vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
#if defined (DMX_USE_USART1)
	timer_channel_output_mode_config(TIMER1, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_1, ~0);
#endif

#if defined (DMX_USE_USART2)
	timer_channel_output_mode_config(TIMER1, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, ~0);
#endif

#if defined (DMX_USE_UART3)
	timer_channel_output_mode_config(TIMER1, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_3, ~0);
#endif

	NVIC_SetPriority(TIMER1_IRQn, 0);
	NVIC_EnableIRQ(TIMER1_IRQn);

	timer_enable(TIMER1);
}

static void timer4_config() {
	rcu_periph_clock_enable(RCU_TIMER4);
	timer_deinit(TIMER4);

	timer_parameter_struct timer_initpara;

	timer_initpara.prescaler = TIMER_PSC_1MHZ;
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = ~0;
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER4, &timer_initpara);

	timer_flag_clear(TIMER4, ~0);
	timer_interrupt_flag_clear(TIMER4, ~0);

#if defined (DMX_USE_UART4)
	timer_channel_output_mode_config(TIMER4, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_0, ~0);
#endif

#if defined (DMX_USE_USART5)
	timer_channel_output_mode_config(TIMER4, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_1, ~0);
#endif

#if defined (DMX_USE_UART6)
	timer_channel_output_mode_config(TIMER4, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_2, ~0);
#endif

#if defined (DMX_USE_UART7)
	timer_channel_output_mode_config(TIMER4, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3, ~0);
#endif

	NVIC_SetPriority(TIMER4_IRQn, 0);
	NVIC_EnableIRQ(TIMER4_IRQn);

	timer_enable(TIMER4);
}

#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
static void timer2_config() {
	rcu_periph_clock_enable(RCU_TIMER2);
	timer_deinit(TIMER2);

	timer_parameter_struct timer_initpara;

	timer_initpara.prescaler = TIMER_PSC_1MHZ;
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = static_cast<uint32_t>(~0);
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER2, &timer_initpara);

	timer_flag_clear(TIMER2, ~0);
	timer_interrupt_flag_clear(TIMER2, ~0);

	timer_channel_output_mode_config(TIMER2, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);

	NVIC_SetPriority(TIMER2_IRQn, 1);
	NVIC_EnableIRQ(TIMER2_IRQn);

	timer_enable(TIMER2);
}

static void timer3_config() {
#if DMX_MAX_PORTS >= 5
	rcu_periph_clock_enable(RCU_TIMER3);
	timer_deinit(TIMER3);

	timer_parameter_struct timer_initpara;

	timer_initpara.prescaler = TIMER_PSC_1MHZ;
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = static_cast<uint32_t>(~0);
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER3, &timer_initpara);

	timer_flag_clear(TIMER3, ~0);
	timer_interrupt_flag_clear(TIMER3, ~0);

	timer_channel_output_mode_config(TIMER3, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER3, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER3, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER3, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);

	NVIC_SetPriority(TIMER3_IRQn, 1);
	NVIC_EnableIRQ(TIMER3_IRQn);

	timer_enable(TIMER3);
#endif
}

static void timer6_config() {
	rcu_periph_clock_enable(RCU_TIMER6);
	timer_deinit(TIMER6);

	timer_parameter_struct timer_initpara;
	timer_initpara.prescaler = TIMER_PSC_10KHZ;
	timer_initpara.period = 10000;		// 1 second
	timer_init(TIMER6, &timer_initpara);

	timer_flag_clear(TIMER6, ~0);
	timer_interrupt_flag_clear(TIMER6, ~0);

	timer_interrupt_enable(TIMER6, TIMER_INT_UP);

	NVIC_SetPriority(TIMER6_IRQn, 0);
	NVIC_EnableIRQ(TIMER6_IRQn);

	timer_enable(TIMER6);
}
#endif

static void usart_dma_config(void) {
	DMA_PARAMETER_STRUCT dma_init_struct;
	rcu_periph_clock_enable(RCU_DMA0);
	rcu_periph_clock_enable(RCU_DMA1);
#if defined (GD32H7XX)
	rcu_periph_clock_enable(RCU_DMAMUX);
#endif
	/*
	 * USART 0
	 */
#if defined (DMX_USE_USART0)
	dma_deinit(USART0_DMA, USART0_TX_DMA_CH);
# if defined (GD32H7XX)
	dma_init_struct.request = DMA_REQUEST_USART0_TX;
# endif
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
# if defined (GD32F4XX) || defined (GD32H7XX)
# else
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
# endif
# if defined (GD32H7XX)
	dma_init_struct.periph_addr = (uint32_t) &USART_TDATA(USART0);
# else
	dma_init_struct.periph_addr = USART0 + 0x04U;
# endif
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
# if defined (GD32F4XX) || defined (GD32H7XX)
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
# else
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
# endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(USART0_DMA, USART0_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(USART0_DMA, USART0_TX_DMA_CH);
	dma_memory_to_memory_disable(USART0_DMA, USART0_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(USART0_DMA, USART0_TX_DMA_CH, USART0_TX_DMA_SUBPERIx);
# endif
	dma_interrupt_disable(USART0_DMA, USART0_TX_DMA_CH, DMA_INTERRUPT_DISABLE);
# if !defined (GD32F4XX)
	NVIC_SetPriority(DMA0_Channel3_IRQn, 1);
	NVIC_EnableIRQ(DMA0_Channel3_IRQn);
# else
	NVIC_SetPriority(DMA1_Channel7_IRQn, 1);
	NVIC_EnableIRQ(DMA1_Channel7_IRQn);
# endif
#endif
	/*
	 * USART 1
	 */
#if defined (DMX_USE_USART1)
	dma_deinit(USART1_DMA, USART1_TX_DMA_CH);
# if defined (GD32H7XX)
	dma_init_struct.request = DMA_REQUEST_USART1_TX;
# endif
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
# if defined (GD32F4XX) || defined (GD32H7XX)
# else
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
# endif
# if defined (GD32H7XX)
	dma_init_struct.periph_addr = (uint32_t) &USART_TDATA(USART1);
# else
	dma_init_struct.periph_addr = USART1 + 0x04U;
# endif
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
# if defined (GD32F4XX) || defined (GD32H7XX)
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
# else
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
# endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(USART1_DMA, USART1_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(USART1_DMA, USART1_TX_DMA_CH);
	dma_memory_to_memory_disable(USART1_DMA, USART1_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(USART1_DMA, USART1_TX_DMA_CH, USART1_TX_DMA_SUBPERIx);
# endif
	dma_interrupt_disable(USART1_DMA, USART1_TX_DMA_CH, DMA_INTERRUPT_DISABLE);
	NVIC_SetPriority(DMA0_Channel6_IRQn, 1);
	NVIC_EnableIRQ(DMA0_Channel6_IRQn);
#endif
	/*
	 * USART 2
	 */
#if defined (DMX_USE_USART2)
	dma_deinit(USART2_DMA, USART2_TX_DMA_CH);
# if defined (GD32H7XX)
	dma_init_struct.request = DMA_REQUEST_USART2_TX;
# endif
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
# if defined (GD32F4XX) || defined (GD32H7XX)
# else
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
# endif
# if defined (GD32H7XX)
	dma_init_struct.periph_addr = (uint32_t) &USART_TDATA(USART2);
# else
	dma_init_struct.periph_addr = USART2 + 0x04U;
# endif
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
# if defined (GD32F4XX) || defined (GD32H7XX)
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
# else
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
# endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(USART2_DMA, USART2_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(USART2_DMA, USART2_TX_DMA_CH);
	dma_memory_to_memory_disable(USART2_DMA, USART2_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(USART2_DMA, USART2_TX_DMA_CH, USART2_TX_DMA_SUBPERIx);
# endif
	dma_interrupt_disable(USART2_DMA, USART2_TX_DMA_CH, DMA_INTERRUPT_DISABLE);
#if defined (GD32F4XX) || defined (GD32H7XX)
	NVIC_SetPriority(DMA0_Channel3_IRQn, 1);
	NVIC_EnableIRQ(DMA0_Channel3_IRQn);
# else
	NVIC_SetPriority(DMA0_Channel1_IRQn, 1);
	NVIC_EnableIRQ(DMA0_Channel1_IRQn);
# endif
#endif
	/*
	 * UART 3
	 */
#if defined (DMX_USE_UART3)
	dma_deinit(UART3_DMA, UART3_TX_DMA_CH);
# if defined (GD32H7XX)
	dma_init_struct.request = DMA_REQUEST_UART3_TX;
# endif
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
# if defined (GD32F4XX) || defined (GD32H7XX)
# else
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
# endif
# if defined (GD32H7XX)
	dma_init_struct.periph_addr = (uint32_t) &USART_TDATA(UART3);
# else
	dma_init_struct.periph_addr = UART3 + 0x04U;
# endif
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
# if defined (GD32F4XX) || defined (GD32H7XX)
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
# else
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
# endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(UART3_DMA, UART3_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(UART3_DMA, UART3_TX_DMA_CH);
	dma_memory_to_memory_disable(UART3_DMA, UART3_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(UART3_DMA, UART3_TX_DMA_CH, UART3_TX_DMA_SUBPERIx);
# endif
	dma_interrupt_disable(UART3_DMA, UART3_TX_DMA_CH, DMA_INTERRUPT_DISABLE);
# if !defined (GD32F4XX)
	NVIC_SetPriority(DMA1_Channel4_IRQn, 1);
	NVIC_EnableIRQ(DMA1_Channel4_IRQn);
# else
	NVIC_SetPriority(DMA0_Channel4_IRQn, 1);
	NVIC_EnableIRQ(DMA0_Channel4_IRQn);
# endif
#endif
	/*
	 * UART 4
	 */
#if defined (DMX_USE_UART4)
	dma_deinit(UART4_DMA, UART4_TX_DMA_CH);
# if defined (GD32H7XX)
	dma_init_struct.request = DMA_REQUEST_UART4_TX;
# endif
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
# if defined (GD32F4XX) || defined (GD32H7XX)
# else
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
# endif
# if defined (GD32H7XX)
	dma_init_struct.periph_addr = (uint32_t) &USART_TDATA(UART4);
# else
	dma_init_struct.periph_addr = UART4 + 0x04U;
# endif
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined (GD32F4XX) || defined (GD32H7XX)
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(UART4_DMA, UART4_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(UART4_DMA, UART4_TX_DMA_CH);
	dma_memory_to_memory_disable(UART4_DMA, UART4_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(UART4_DMA, UART4_TX_DMA_CH, UART4_TX_DMA_SUBPERIx);
# endif
	dma_interrupt_disable(UART4_DMA, UART4_TX_DMA_CH, DMA_INTERRUPT_DISABLE);
# if !defined (GD32F4XX)
	NVIC_SetPriority(DMA1_Channel3_IRQn, 1);
	NVIC_EnableIRQ(DMA1_Channel3_IRQn);
# else
	NVIC_SetPriority(DMA0_Channel7_IRQn, 1);
	NVIC_EnableIRQ(DMA0_Channel7_IRQn);
# endif
#endif
	/*
	 * USART 5
	 */
#if defined (DMX_USE_USART5)
	dma_deinit(USART5_DMA, USART5_TX_DMA_CH);
# if defined (GD32H7XX)
	dma_init_struct.request = DMA_REQUEST_USART5_TX;
# endif
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
# if defined (GD32F20X)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
# endif
# if defined (GD32H7XX)
	dma_init_struct.periph_addr = (uint32_t) &USART_TDATA(USART5);
# else
	dma_init_struct.periph_addr = USART5 + 0x04U;
# endif
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined (GD32F20X)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
# else
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(USART5_DMA, USART5_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(USART5_DMA, USART5_TX_DMA_CH);
	dma_memory_to_memory_disable(USART5_DMA, USART5_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(USART5_DMA, USART5_TX_DMA_CH, USART5_TX_DMA_SUBPERIx);
# endif
	dma_interrupt_disable(USART5_DMA, USART5_TX_DMA_CH, DMA_INTERRUPT_DISABLE);
	NVIC_SetPriority(DMA1_Channel6_IRQn, 1);
	NVIC_EnableIRQ(DMA1_Channel6_IRQn);
#endif
	/*
	 * UART 6
	 */
#if defined (DMX_USE_UART6)
	dma_deinit(UART6_DMA, UART6_TX_DMA_CH);
# if defined (GD32H7XX)
	dma_init_struct.request = DMA_REQUEST_UART6_TX;
# endif
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
# if defined (GD32F20X)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
# endif
# if defined (GD32H7XX)
	dma_init_struct.periph_addr = (uint32_t) &USART_TDATA(UART6);
# else
	dma_init_struct.periph_addr = UART6 + 0x04U;
# endif
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
# if defined (GD32F20X)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
# else
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
# endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(UART6_DMA, UART6_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(UART6_DMA, UART6_TX_DMA_CH);
	dma_memory_to_memory_disable(UART6_DMA, UART6_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(UART6_DMA, UART6_TX_DMA_CH, UART6_TX_DMA_SUBPERIx);
# endif
	dma_interrupt_disable(UART6_DMA, UART4_TX_DMA_CH, DMA_INTERRUPT_DISABLE);
# if defined (GD32F20X)
	NVIC_SetPriority(DMA1_Channel4_IRQn, 1);
	NVIC_EnableIRQ(DMA1_Channel4_IRQn);
# else
	NVIC_SetPriority(DMA0_Channel1_IRQn, 1);
	NVIC_EnableIRQ(DMA0_Channel1_IRQn);
# endif
#endif
	/*
	 * UART 7
	 */
#if defined (DMX_USE_UART7)
	dma_deinit(UART7_DMA, UART7_TX_DMA_CH);
# if defined (GD32H7XX)
	dma_init_struct.request = DMA_REQUEST_UART7_TX;
# endif
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
# if defined (GD32F20X)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
# endif
# if defined (GD32H7XX)
	dma_init_struct.periph_addr = (uint32_t) &USART_TDATA(UART7);
# else
	dma_init_struct.periph_addr = UART7 + 0x04U;
# endif
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
# if defined (GD32F20X)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
# else
	dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
# endif
	dma_init_struct.priority = DMA_PRIORITY_HIGH;
	dma_init(UART7_DMA, UART7_TX_DMA_CH, &dma_init_struct);
	/* configure DMA mode */
	dma_circulation_disable(UART7_DMA, UART7_TX_DMA_CH);
	dma_memory_to_memory_disable(UART7_DMA, UART7_TX_DMA_CH);
# if defined (GD32F4XX)
	dma_channel_subperipheral_select(UART7_DMA, UART7_TX_DMA_CH, UART7_TX_DMA_SUBPERIx);
# endif
#if defined (GD32F20X)
	NVIC_SetPriority(DMA1_Channel3_IRQn, 1);
	NVIC_EnableIRQ(DMA1_Channel3_IRQn);
# else
	NVIC_SetPriority(DMA0_Channel0_IRQn, 1);
	NVIC_EnableIRQ(DMA0_Channel0_IRQn);
# endif
#endif
}

