vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
void TIMER4_IRQHandler() {
	/*
	 * UART 4
	 */
#if defined (DMX_USE_UART4)
	if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0) {
		switch (s_TxBuffer[dmx::config::UART4_PORT].State) {
		case TxRxState::DMXINTER:
			_gpio_mode_output(UART4_GPIO_TX_PORT, UART4_TX_PIN);
			GPIO_BC(UART4_GPIO_TX_PORT) = UART4_TX_PIN;
			s_TxBuffer[dmx::config::UART4_PORT].State = TxRxState::BREAK;
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_0, TIMER_CNT(TIMER4) + s_nDmxTransmitBreakTime);
			break;
		case TxRxState::BREAK:
			_gpio_mode_af(UART4_GPIO_TX_PORT, UART4_TX_PIN, UART4);
			s_TxBuffer[dmx::config::UART4_PORT].State = TxRxState::MAB;
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_0, TIMER_CNT(TIMER4) + s_nDmxTransmitMabTime);
			break;
		case TxRxState::MAB: {
			uint32_t dmaCHCTL = DMA_CHCTL(UART4_DMA, UART4_TX_DMA_CH);
			dmaCHCTL &= ~DMA_CHXCTL_CHEN;
			DMA_CHCTL(UART4_DMA, UART4_TX_DMA_CH) = dmaCHCTL;
			const auto *p = &s_TxBuffer[dmx::config::UART4_PORT].dmx;
			DMA_CHMADDR(UART4_DMA, UART4_TX_DMA_CH) = (uint32_t) p->data;
			DMA_CHCNT(UART4_DMA, UART4_TX_DMA_CH) = (p->nLength & DMA_CHXCNT_CNT);
			dmaCHCTL |= DMA_CHXCTL_CHEN;
			dmaCHCTL |= DMA_INTERRUPT_ENABLE;
			DMA_CHCTL(UART4_DMA, UART4_TX_DMA_CH) = dmaCHCTL;
			usart_dma_transmit_config(UART4, USART_TRANSMIT_DMA_ENABLE);
		}
			break;
		default:
			break;
		}

		timer_interrupt_flag_clear(TIMER4, TIMER_INT_FLAG_CH0);
		return;
	}
#endif
	/*
	 * USART 5
	 */
#if defined (DMX_USE_USART5)
	if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1) {
		switch (s_TxBuffer[dmx::config::USART5_PORT].State) {
		case TxRxState::DMXINTER:
			_gpio_mode_output(USART5_GPIO_PORT, USART5_TX_PIN);
			GPIO_BC(USART5_GPIO_PORT) = USART5_TX_PIN;
			s_TxBuffer[dmx::config::USART5_PORT].State = TxRxState::BREAK;
			TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmitBreakTime;
			break;
		case TxRxState::BREAK:
			_gpio_mode_af(USART5_GPIO_PORT, USART5_TX_PIN, USART5);
			s_TxBuffer[dmx::config::USART5_PORT].State = TxRxState::MAB;
			TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + s_nDmxTransmitMabTime;
			break;
		case TxRxState::MAB: {
			uint32_t dmaCHCTL = DMA_CHCTL(USART5_DMA, USART5_TX_DMA_CH);
			dmaCHCTL &= ~DMA_CHXCTL_CHEN;
			DMA_CHCTL(USART5_DMA, USART5_TX_DMA_CH) = dmaCHCTL;
			const auto *p = &s_TxBuffer[dmx::config::USART5_PORT].dmx;
			DMA_CHMADDR(USART5_DMA, USART5_TX_DMA_CH) = (uint32_t) p->data;
			DMA_CHCNT(USART5_DMA, USART5_TX_DMA_CH) = (p->nLength & DMA_CHXCNT_CNT);
			dmaCHCTL |= DMA_CHXCTL_CHEN;
			dmaCHCTL |= DMA_INTERRUPT_ENABLE;
			DMA_CHCTL(USART5_DMA, USART5_TX_DMA_CH) = dmaCHCTL;
			usart_dma_transmit_config(USART5, USART_TRANSMIT_DMA_ENABLE);
		}
			break;
		default:
			break;
		}

		timer_interrupt_flag_clear(TIMER4, TIMER_INT_FLAG_CH1);
		return;
	}
#endif
	/*
	 * UART 6
	 */
#if defined (DMX_USE_UART6)
	if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2) {
		switch (s_TxBuffer[dmx::config::UART6_PORT].State) {
		case TxRxState::DMXINTER:
			_gpio_mode_output(UART6_GPIO_PORT, UART6_TX_PIN);
			GPIO_BC(UART6_GPIO_PORT) = UART6_TX_PIN;
			s_TxBuffer[dmx::config::UART6_PORT].State = TxRxState::BREAK;
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_2, TIMER_CNT(TIMER4) + s_nDmxTransmitBreakTime);
			break;
		case TxRxState::BREAK:
			_gpio_mode_af(UART6_GPIO_PORT, UART6_TX_PIN, UART6);
			s_TxBuffer[dmx::config::UART6_PORT].State = TxRxState::MAB;
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_2, TIMER_CNT(TIMER4) + s_nDmxTransmitMabTime);
			break;
		case TxRxState::MAB: {
			uint32_t dmaCHCTL = DMA_CHCTL(UART6_DMA, UART6_TX_DMA_CH);
			dmaCHCTL &= ~DMA_CHXCTL_CHEN;
			DMA_CHCTL(UART6_DMA, UART6_TX_DMA_CH)= dmaCHCTL;
			dma_interrupt_flag_clear(UART6_DMA, UART6_TX_DMA_CH, DMA_INTF_FTFIF);
			const auto *p = &s_TxBuffer[dmx::config::UART6_PORT].dmx;
			DMA_CHMADDR(UART6_DMA, UART6_TX_DMA_CH) = (uint32_t) p->data;
			DMA_CHCNT(UART6_DMA, UART6_TX_DMA_CH) = (p->nLength & DMA_CHXCNT_CNT);
			dmaCHCTL |= DMA_CHXCTL_CHEN;
			dmaCHCTL |= DMA_INTERRUPT_ENABLE;
			DMA_CHCTL(UART6_DMA, UART6_TX_DMA_CH)= dmaCHCTL;
			usart_dma_transmit_config(UART6, USART_TRANSMIT_DMA_ENABLE);
		}
			break;
		default:
			break;
		}

		timer_interrupt_flag_clear(TIMER4, TIMER_INT_FLAG_CH2);
		return;
	}
#endif
	/*
	 * UART 7
	 */
#if defined (DMX_USE_UART7)
	if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH3) == TIMER_INT_FLAG_CH3) {
		switch (s_TxBuffer[dmx::config::UART7_PORT].State) {
		case TxRxState::DMXINTER:
			_gpio_mode_output(UART7_GPIO_PORT, UART7_TX_PIN);
			GPIO_BC(UART7_GPIO_PORT) = UART7_TX_PIN;
			s_TxBuffer[dmx::config::UART7_PORT].State = TxRxState::BREAK;
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3, TIMER_CNT(TIMER4) + s_nDmxTransmitBreakTime);
			break;
		case TxRxState::BREAK:
			_gpio_mode_af(UART7_GPIO_PORT, UART7_TX_PIN, UART7);
			s_TxBuffer[dmx::config::UART7_PORT].State = TxRxState::MAB;
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3, TIMER_CNT(TIMER4) + s_nDmxTransmitMabTime);
			break;
		case TxRxState::MAB: {
			uint32_t dmaCHCTL = DMA_CHCTL(UART7_DMA, UART7_TX_DMA_CH);
			dmaCHCTL &= ~DMA_CHXCTL_CHEN;
			DMA_CHCTL(UART7_DMA, UART7_TX_DMA_CH) = dmaCHCTL;
			dma_interrupt_flag_clear(UART7_DMA, UART7_TX_DMA_CH, DMA_INTF_FTFIF);
			const auto *p = &s_TxBuffer[dmx::config::UART7_PORT].dmx;
			DMA_CHMADDR(UART7_DMA, UART7_TX_DMA_CH) = (uint32_t) p->data;
			DMA_CHCNT(UART7_DMA, UART7_TX_DMA_CH) = (p->nLength & DMA_CHXCNT_CNT);
			dmaCHCTL |= DMA_CHXCTL_CHEN;
			dmaCHCTL |= DMA_INTERRUPT_ENABLE;
			DMA_CHCTL(UART7_DMA, UART7_TX_DMA_CH)= dmaCHCTL;
			usart_dma_transmit_config(UART7, USART_TRANSMIT_DMA_ENABLE);
		}
			break;
		default:
			break;
		}

		timer_interrupt_flag_clear(TIMER4, TIMER_INT_FLAG_CH3);
		return;
	}
#endif
	timer_interrupt_flag_clear(TIMER4, ~0);
}

#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
void TIMER2_IRQHandler() {
	const auto nIntFlag = TIMER_INTF(TIMER2);

	if ((nIntFlag & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0) {
		if (s_RxBuffer[0].State == TxRxState::DMXDATA) {
			s_RxBuffer[0].State = TxRxState::IDLE;
			s_RxBuffer[0].Dmx.nSlotsInPacket |= 0x8000;
		} else if (s_RxBuffer[0].State == TxRxState::RDMDISC) {
			s_RxBuffer[0].State = TxRxState::IDLE;
			s_RxBuffer[0].Dmx.nSlotsInPacket |= 0x4000;
		}
	}
#if DMX_MAX_PORTS >= 2
	else if ((nIntFlag & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1) {
		if (s_RxBuffer[1].State == TxRxState::DMXDATA) {
			s_RxBuffer[1].State = TxRxState::IDLE;
			s_RxBuffer[1].Dmx.nSlotsInPacket |= 0x8000;
		} else if (s_RxBuffer[1].State == TxRxState::RDMDISC) {
			s_RxBuffer[1].State = TxRxState::IDLE;
			s_RxBuffer[1].Dmx.nSlotsInPacket |= 0x4000;
		}
	}
#endif
#if DMX_MAX_PORTS >= 3
	else if ((nIntFlag & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2) {
		if (s_RxBuffer[2].State == TxRxState::DMXDATA) {
			s_RxBuffer[2].State = TxRxState::IDLE;
			s_RxBuffer[2].Dmx.nSlotsInPacket |= 0x8000;
		} else if (s_RxBuffer[2].State == TxRxState::RDMDISC) {
			s_RxBuffer[2].State = TxRxState::IDLE;
			s_RxBuffer[2].Dmx.nSlotsInPacket |= 0x4000;
		}
	}
#endif
#if DMX_MAX_PORTS >= 4
	else if ((nIntFlag & TIMER_INT_FLAG_CH3) == TIMER_INT_FLAG_CH3) {
		if (s_RxBuffer[3].State == TxRxState::DMXDATA) {
			s_RxBuffer[3].State = TxRxState::IDLE;
			s_RxBuffer[3].Dmx.nSlotsInPacket |= 0x8000;
		} else if (s_RxBuffer[3].State == TxRxState::RDMDISC) {
			s_RxBuffer[3].State = TxRxState::IDLE;
			s_RxBuffer[3].Dmx.nSlotsInPacket |= 0x4000;
		}
	}
#endif
	timer_interrupt_flag_clear(TIMER2, nIntFlag);
}

void TIMER3_IRQHandler() {
	const auto nIntFlag = TIMER_INTF(TIMER3);
#if DMX_MAX_PORTS >= 5
	if ((nIntFlag & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0) {
		if (s_RxBuffer[4].State == TxRxState::DMXDATA) {
			s_RxBuffer[4].State = TxRxState::IDLE;
			s_RxBuffer[4].Dmx.nSlotsInPacket |= 0x8000;
		} else if (s_RxBuffer[4].State == TxRxState::RDMDISC) {
			s_RxBuffer[4].State = TxRxState::IDLE;
			s_RxBuffer[4].Dmx.nSlotsInPacket |= 0x4000;
		}
	}
# if DMX_MAX_PORTS >= 6
	else if ((nIntFlag & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1) {
		if (s_RxBuffer[5].State == TxRxState::DMXDATA) {
			s_RxBuffer[5].State = TxRxState::IDLE;
			s_RxBuffer[5].Dmx.nSlotsInPacket |= 0x8000;
		} else if (s_RxBuffer[5].State == TxRxState::RDMDISC) {
			s_RxBuffer[5].State = TxRxState::IDLE;
			s_RxBuffer[5].Dmx.nSlotsInPacket |= 0x4000;
		}
	}
# endif
# if DMX_MAX_PORTS >= 7
	else if ((nIntFlag & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2) {
		if (s_RxBuffer[6].State == TxRxState::DMXDATA) {
			s_RxBuffer[6].State = TxRxState::IDLE;
			s_RxBuffer[6].Dmx.nSlotsInPacket |= 0x8000;
		} else if (s_RxBuffer[6].State == TxRxState::RDMDISC) {
			s_RxBuffer[6].State = TxRxState::IDLE;
			s_RxBuffer[6].Dmx.nSlotsInPacket |= 0x4000;
		}
	}
# endif
# if DMX_MAX_PORTS == 8
	else if ((nIntFlag & TIMER_INT_FLAG_CH3) == TIMER_INT_FLAG_CH3) {
		if (s_RxBuffer[7].State == TxRxState::DMXDATA) {
			s_RxBuffer[7].State = TxRxState::IDLE;
			s_RxBuffer[7].Dmx.nSlotsInPacket |= 0x8000;
		} else if (s_RxBuffer[7].State == TxRxState::RDMDISC) {
			s_RxBuffer[7].State = TxRxState::IDLE;
			s_RxBuffer[7].Dmx.nSlotsInPacket |= 0x4000;
		}
	}
# endif
#endif
	timer_interrupt_flag_clear(TIMER3, nIntFlag);
}

void TIMER6_IRQHandler() {
	const auto nIntFlag = TIMER_INTF(TIMER6);

	if ((nIntFlag & TIMER_INT_FLAG_UP) == TIMER_INT_FLAG_UP) {
		for (auto i = 0; i < DMX_MAX_PORTS; i++) {
			sv_nRxDmxPackets[i].nPerSecond = sv_nRxDmxPackets[i].nCount - sv_nRxDmxPackets[i].nCountPrevious;
			sv_nRxDmxPackets[i].nCountPrevious = sv_nRxDmxPackets[i].nCount;
		}

